Creates a new MEP Electrical System element from an unused Connector.
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public static ElectricalSystem Create(
	Connector connector,
	ElectricalSystemType elecSysType
)
  Visual Basic
Public Shared Function Create ( _
	connector As Connector, _
	elecSysType As ElectricalSystemType _
) As ElectricalSystem
  Visual C++
public:
static ElectricalSystem^ Create(
	Connector^ connector,
	ElectricalSystemType elecSysType
)
 Parameters
  connector
 Type:  Autodesk.Revit.DB Connector
 The Connector to create this Electrical System.
  elecSysType
 Type:  Autodesk.Revit.DB.Electrical ElectricalSystemType
 The System Type of electrical system.
 Return Value
 If successful a new MEP Electrical System element within the project, otherwise    a null reference (  Nothing  in Visual Basic)  .
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   A value passed for an enumeration argument is not a member of that enumeration
   Autodesk.Revit.Exceptions DisabledDisciplineException   |   None of the following disciplines is enabled: Mechanical Electrical Piping.
 See Also
  ElectricalSystem Class
  Create Overload
  Autodesk.Revit.DB.Electrical Namespace